In [1]:
import pandas as pd
import numpy as np
data=pd.Series([1.2,-3.5,np.nan,0,None])
data

C:\Users\E 555\anaconda3\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\Users\E 555\anaconda3\lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.4' currently installed).
  from pandas.core import (

0    1.2
1   -3.5
2    NaN
3    0.0
4    NaN
dtype: float64

In [2]:
data.isna() # both np.nan,none value are taken as missing value

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [3]:
data.notna()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [4]:
data[data.notna()] #it returns the nonnull values and corresponding index values.

0    1.2
1   -3.5
3    0.0
dtype: float64

In [5]:
data.dropna()#it returns the Series with only the nonnull data and corresponding index values.

0    1.2
1   -3.5
3    0.0
dtype: float64

In [6]:
data=pd.DataFrame([[1.2,-3.5,np.nan,4],
                   [np.nan,0,7,None],
                   [4.7,7.4,-0.7,0.4]])
data

     0    1    2    3
0  1.2 -3.5  NaN  4.0
1  NaN  0.0  7.0  NaN
2  4.7  7.4 -0.7  0.4

In [7]:
data.dropna(axis=1) #it will drop the nonnull value of column

     1
0 -3.5
1  0.0
2  7.4

In [8]:
data.dropna(axis=0)#it will drop the nonnull value of row

     0    1    2    3
2  4.7  7.4 -0.7  0.4

In [9]:
data.dropna(how='all')

     0    1    2    3
0  1.2 -3.5  NaN  4.0
1  NaN  0.0  7.0  NaN
2  4.7  7.4 -0.7  0.4

In [10]:
data.dropna(how='any') #it will return the row where all value are nonnull.

     0    1    2    3
2  4.7  7.4 -0.7  0.4

In [11]:
data.dropna(thresh=3)#it will drop the row where at least 3 are non-null value.

     0    1    2    3
0  1.2 -3.5  NaN  4.0
2  4.7  7.4 -0.7  0.4

In [12]:
data.dropna(thresh=4)# at least 4 value are non-value are present

     0    1    2    3
2  4.7  7.4 -0.7  0.4